var String=require("String");
var List=require("List");
var Lexing=require("Lexing");
var Buffer=require("Buffer");
var Str=require("Str");
var Odoc_misc=require("Odoc_misc");
var line_number=[0,0];
var char_number=[0,0];
var $js=Buffer["create"];
var string_buffer=$js(32);
var
 reset_string_buffer=
  function(param){var $js$1=Buffer["reset"];return $js$1(string_buffer)};
var $js$1=Buffer["add_char"];
var ajout_char_string=$js$1(string_buffer);
var $js$2=Buffer["add_string"];
var ajout_string=$js$2(string_buffer);
var
 lecture_string=
  function(param){var $js$3=Buffer["contents"];return $js$3(string_buffer)};
var description=[0,""];
var blank="[ \r\t\f]";
var open_brackets=[0,0];
var verb_mode=[0,0];
var target_mode=[0,0];
var shortcut_list_mode=[0,0];
var ele_ref_mode=[0,0];
var code_pre_mode=[0,0];
var
 init=
  function(param)
   {open_brackets[1]=0,0;
    verb_mode[1]=0,0;
    target_mode[1]=0,0;
    shortcut_list_mode[1]=0,0;
    ele_ref_mode[1]=0,0;
    code_pre_mode[1]=0,0;
    line_number[1]=0,0;
    return char_number[1]=0,0};
var
 incr_cpts=
  function(lexbuf)
   {var $js$3=Lexing["lexeme"];
    var s=$js$3(lexbuf);
    var $js$4=Str["split_delim"];
    var $js$5=Str["regexp_string"];
    var $js$6=$js$5("\n");
    var l=$js$4($js$6,s);
    var $js$7=List["rev"];
    var match=$js$7(l);
    var $js$8=match;
    if($js$8)
     {var s2=match[1];
      var $js$9=match[2];
      if($js$9)
       {var $js$10=List["length"];
        var $js$11=$js$10(l);
        var $js$12=$js$11-1;
        var $js$13=line_number[1]+$js$12;
        line_number[1]=$js$13,0;
        return char_number[1]=s2["length"],0}
      else
       {return char_number[1]=char_number[1]+s2["length"],0}}
    else
     {return 0}};
var
 __ocaml_lex_tables=
  [0,
   "\0\0ÎÿÑÿ\0\0\x06\0\x01\0\x01\0\x02\0S\0\0\0şÿ\x13\0ÿÿ\x01\0\x01\0\x05\0\x12\0\0\0\x01\0Ÿ\0™\0”\0\x02\0\x06\0\x07\0¿\0\x02\0\x03\0ß\0\x06\0\x07\0\b\0\x03\0\x0b\0\x06\0J\0A\0\x10\0•\0\x12\0ëÿî\0ıÿüÿûÿ™\0\0‹\0Ÿ\0”\0\x16\0öÿ¢\0\x18\0\x1a\0óÿ!\0òÿ\"\0ñÿı\0o\x01\x01\x07\0ì\x01\x01\x007\x02‚\x02Í\x02?\x03±\x03#\x04\x0b\0\x10\0•\x04\0\0\x07\x05y\x05ë\x05Å\x057\x06©\x06úÿùÿøÿ÷ÿõÿôÿ\x1b\x07\x07ÿ\x07ïÿM\bt\x01ğÿ\x05\0êÿ\x1f\0\0\0\x01\0\x1d\0}\0{\0\x1a\x007\0Š\0\x03\0çÿİ\0†\b¨\0À\0¾\0¿\0R\x01Î\0Ü\0İ\x01İ\0Ş\0ê\0ê\0å\0ö\0ê\0ù\0Î\0\x01\0‰\x01åÿÍ\0ø\0@\x01D\x03äÿ\x1c\x01'\x01(\x01 \x01\x1e\x010\x01-\x01/\x01d\x01I\x03ãÿ:\x017\x01C\x01>\x01A\x01‘\x01N\x03âÿX\x01i\x01Z\x01q\x01\x7f\x01‡\x01³\x01´\x01Y\x03áÿ^\x03Øÿ€\x01\x01º\x01¶\x03àÿ’\x01\x01™\x01Ä\x01»\x03Üÿ‘\x01¢\x01’\x01“\x01&\x03\x01À\x03ßÿ˜\x01¤\x01Ğ\x01Ë\x03Şÿ¤\x01¤\x01à\x01Ğ\x03Ùÿ³\x01¶\x01À\x01È\x01¶\x01¸\x01â\x01\x0e\x02(\x04İÿæ\x01Ö\x01ã\x01\x02\x02\x04\x029\x02-\x04Ûÿ\x11\x02\x0f\x02\r\x02\x12\x02&\x02/\x02Z\x022\x04Úÿ1\x021\x02\x1f\x02P\x02T\x02K\x02K\x02C\x02×ÿÖÿîÿ\x05\0íÿ~\x02s\x02Ä\x02Ä\x02Ÿ\x02èÿ=\x04\x02\0\x03\0¤\x04a\x02ÕÿÔÿÓÿB\x04",
   "ÿÿÿÿÿÿ1\x001\0\x14\0\x13\x001\x000\x001\0ÿÿ1\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ/\0/\0\x19\0\x16\0ÿÿÿÿ/\0/\0/\0/\0/\0/\0\b\0\x07\0/\0ÿÿ/\0/\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\f\0\r\0/\0ÿÿÿÿ\x0f\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\x19\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\x1a\0ÿÿÿÿÿÿÿÿ\x1b\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\x1c\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\x1d\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\x1e\0ÿÿ'\0ÿÿÿÿÿÿÿÿ\x1f\0ÿÿÿÿÿÿÿÿÿÿ#\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿ \0ÿÿÿÿÿÿÿÿ!\0ÿÿÿÿÿÿÿÿ&\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\"\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿ$\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ%\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ-\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ",
   "\x01\0\0\0\0\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\0\0ÿÿ\0\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\0\0ÿÿ\0\0\0\0\0\0ÿÿÿÿÿÿÿÿÿÿÿÿ\0\0ÿÿÿÿÿÿ\0\0ÿÿ\0\0ÿÿ\0\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\0\0\0\0\0\0\0\0\0\0\0\0ÿÿÿÿÿÿ\0\0ÿÿÿÿ\0\0ÿÿ\0\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\0\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\0\0ÿÿÿÿÿÿÿÿ\0\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\0\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\0\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\0\0ÿÿ\0\0ÿÿÿÿÿÿÿÿ\0\0ÿÿÿÿÿÿÿÿÿÿ\0\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\0\0ÿÿÿÿÿÿÿÿ\0\0ÿÿÿÿÿÿÿÿ\0\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\0\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\0\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\0\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\0\0\0\0\0\0ÿÿ\0\0ÿÿÿÿÿÿÿÿÿÿ\0\0ÿÿÿÿÿÿÿÿÿÿ\0\0\0\0\0\0ÿÿ",
   "\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\x03\0\x04\0\0\0\x03\0\x03\0\0\0ô\0ñ\0\0\0ô\0ô\0U\0U\0\0\0U\0U\0T\0T\0\0\0T\0T\0\0\0\0\0\x03\0;\0ø\0÷\0\0\0\x07\0ô\0\0\0\0\0\0\0\0\0U\0\0\0\0\0\0\0\x14\0T\0ò\0m\0ó\0ë\0\0\0\0\0\0\0\0\0\0\0R\0€\0\t\0é\0,\0+\0\n\0\n\0\x12\0\x10\0\n\0\n\0\n\0&\0\x13\0\x11\0:\0\x1f\0\r\x008\0\n\0\x0e\0(\x006\0\x1e\0\x1d\x003\0\x0f\0\x06\0.\x007\0\"\0#\0\x06\0\x0b\0\x05\0ê\x009\0;\0-\0\x12\0\x10\0_\0Õ\0Í\0&\0\x13\0\x11\0:\0\x1f\0\r\x008\0\f\0\x0e\0\f\x006\0\x1e\0\x1d\0>\0\x0f\0õ\0.\0@\0\"\0#\0\b\0õ\0\n\0ğ\0è\0A\0-\0`\0N\0N\0N\0N\0N\0N\0N\0N\0N\0N\0Ş\0\f\0$\0\f\0Ã\0‡\0%\0<\0<\0G\0<\0<\0<\0<\0<\0<\0<\0<\0F\0<\0<\0<\0<\0<\0E\0<\0<\0<\0<\0<\0<\0<\0<\0?\0$\0‚\0I\0H\0%\0<\0M\0<\0<\0J\0<\0<\0<\0L\0<\0<\0B\0<\0<\0C\0<\0<\0<\0<\0<\0D\0=\0<\0<\0<\0<\0K\0)\0)\0)\0)\0)\0)\0)\0)\0)\0)\0!\0'\0\x1b\0\x15\x004\0/\x000\0š\0\x19\0\x1a\0 \x001\0\x16\x002\x005\0\x17\0²\0›\0~\0±\0y\0\x18\0\x1c\0\x1c\0\x1c\0\x1c\0\x1c\0\x1c\0\x1c\0\x1c\0\x1c\0\x1c\0!\0'\0\x1b\0\x15\x004\0/\x000\0\x02\0\x19\0\x1a\0 \x001\0\x16\x002\x005\0\x17\0x\0w\0v\0k\0y\0\x18\0\x1c\0\x1c\0\x1c\0\x1c\0\x1c\0\x1c\0\x1c\0\x1c\0\x1c\0\x1c\0j\0k\0k\0k\0\n\0)\0)\0)\0)\0)\0)\0)\0)\0)\0)\0k\0x\0w\0v\0*\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0k\0z\0{\0\x7f\0|\0}\0ƒ\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0z\0{\0k\0|\0}\0„\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0ç\0ç\0…\0ç\0ç\0^\0^\0ˆ\0^\0^\0u\0u\0u\0u\0u\0u\0u\0u\0u\0u\0’\0Š\0‹\0ç\0‰\0Œ\0\0\0^\0\0\0l\0l\0\0l\0l\0\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0\0“\0”\0•\0–\0l\0—\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0j\0˜\0«\0œ\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0¦\0Ÿ\0 \0¢\0¤\0d\0§\0e\0¨\0g\0©\0[\0[\0a\0[\0[\0¬\0f\0­\0®\0¯\0¾\0b\0c\0h\0³\0i\0´\0µ\0¹\0º\0»\0¼\0k\0[\0u\0u\0u\0u\0u\0u\0u\0u\0u\0u\0¿\0À\0\\0Á\0k\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0¡\0Ä\0Å\0Æ\0Ç\0È\0É\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0Ê\0Ë\0Î\0Ï\0\\0Ğ\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0Ñ\0Ò\0Ó\0Ö\0×\0Ø\0Ù\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0Ú\0Û\0Ü\0ß\0à\0á\0<\0<\0<\0<\0<\0<\0<\0<\0Z\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0â\0ã\0ä\0å\0æ\0ì\0í\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0ê\0ö\0\0\0\0\0ì\0í\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0Y\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0\0\0î\0ï\0\0\0\0\0\0\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0î\0ï\0\0\0\0\0\0\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0X\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0W\0W\0\0\0W\0W\0†\0†\0\0\0†\0†\0‘\0‘\0\0\0‘\0‘\0™\0™\0\0\0™\0™\0\0\0\0\0\0\0W\0·\0\0\0£\0£\0†\0£\0£\0¥\0¥\0‘\0¥\0¥\0\0\0\0\0™\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0£\0\0\0\0\0\0\0\0\0¥\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0¶\0\0\0\0\0\0\0\0\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0V\0V\0\0\0V\0V\0ª\0ª\0\0\0ª\0ª\0°\0°\0\0\0°\0°\0¸\0¸\0\0\0¸\0¸\0\0\0\0\0\0\0V\0\0\0\0\0½\0½\0ª\0½\0½\0Â\0Â\0°\0Â\0Â\0\0\0\0\0¸\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0½\0\0\0\0\0\0\0\0\0Â\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0\0\0\0\0\0\0\0\0\0\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\x003\x003\0\0\x003\x003\0Ì\0Ì\0\0\0Ì\0Ì\0Ô\0Ô\0\0\0Ô\0Ô\0İ\0İ\0\0\0İ\0İ\0\0\0\0\0\0\x003\0\0\0\0\0ù\0ñ\0Ì\0ù\0ù\0ù\0ñ\0Ô\0ù\0ù\0\0\0\0\0İ\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0ù\0\0\0\0\0\0\0\0\0ù\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0\0\0\0\0\0\0\0\0\0\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0S\0S\0\0\0S\0S\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0ô\0ñ\0\0\0ô\0ô\0\0\0\0\0\0\0S\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0ô\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0ò\0\0\0ó\0\0\0\0\0\0\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0\0\0\0\0\0\0\0\0\0\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0,\0,\0\0\0,\0,\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0,\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0\0\0\0\0\0\0\0\0\0\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0+\0+\0\0\0+\0+\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0+\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0\0\0\0\0\0\0\0\0\0\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0*\0*\0\0\0*\0*\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0*\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0N\0N\0N\0N\0N\0N\0N\0N\0N\0N\0O\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0*\0*\0\0\0*\0*\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0*\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0\0\0\0\0\0\0\0\0Q\0\0\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0*\0*\0\0\0*\0*\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0*\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0\0\0\0\0\0\0\0\0Q\0\0\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\x007\x007\0\0\x007\x007\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\x007\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0\0\0\0\0\0\0\0\0\0\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\x009\x009\0\0\x009\x009\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\x009\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0\0\0\0\0\0\0\0\0\0\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0;\0;\0\0\0;\0;\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0;\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0\0\0\0\0\0\0\0\0\0\0\0\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0\\0\0\0\0\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0]\0\0\0\0\0\0\0\0\0\0\0\0\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\0\0\0\0\0\0\0\0\\0\0\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0t\0n\0\0\0\0\0\0\0\0\0r\0s\0\0\0\0\0o\0\0\0\0\0p\0\0\0\0\0\0\0\0\0\0\0q\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0t\0n\0\0\0\0\0\0\0\0\0r\0s\0\0\0\0\0o\0\0\0\0\0p\0\0\0\0\0\0\0\0\0\0\0q\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0",
   'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\0\0\0\0ÿÿ\0\0\0\0ÿÿ\x04\0\x04\0ÿÿ\x04\0\x04\0H\0H\0ÿÿH\0H\0I\0I\0ÿÿI\0I\0ÿÿÿÿ\0\0A\0ò\0ó\0ÿÿ\0\0\x04\0ÿÿÿÿÿÿÿÿH\0ÿÿÿÿÿÿ\t\0I\0\x04\0j\0\x04\0é\0ÿÿÿÿÿÿÿÿÿÿK\0\x7f\0\0\0\x06\0\x11\0\x12\0\x1a\0\x1b\0\t\0\t\0\x1d\0\x1e\0\x1f\0 \0\t\0\t\0\r\0\x16\0\t\0\x0e\0%\0\t\0\'\0\x0f\0\x17\0\x18\x002\0\t\x005\0\x10\x006\0!\0"\0\0\0\0\0\0\0\x06\x008\0:\0\x10\0\t\0\t\0?\0b\0c\0 \0\t\0\t\0\r\0\x16\0\t\0\x0e\0\x0b\0\t\0\x0b\0\x0f\0\x17\0\x18\0\b\0\t\0\x03\0\x10\0\b\0!\0"\0\0\0\x04\0\0\0\x05\0\x07\0\b\0\x10\0_\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0a\0\x0b\0#\0\x0b\0d\0g\0$\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0#\0h\0\b\0\b\0$\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\b\0\x13\0\x13\0\x13\0\x13\0\x13\0\x13\0\x13\0\x13\0\x13\0\x13\0\x15\0&\0\x14\0\x14\0-\0.\0/\0f\0\x14\0\x14\0\x15\x000\0\x14\x001\x004\0\x14\0e\0f\0i\0e\0n\0\x14\0\x19\0\x19\0\x19\0\x19\0\x19\0\x19\0\x19\0\x19\0\x19\0\x19\0\x15\0&\0\x14\0\x14\0-\0.\0/\0\0\0\x14\0\x14\0\x15\x000\0\x14\x001\x004\0\x14\0o\0p\0q\0s\0n\0\x14\0\x1c\0\x1c\0\x1c\0\x1c\0\x1c\0\x1c\0\x1c\0\x1c\0\x1c\0\x1c\0l\0t\0v\0w\0\x1c\0)\0)\0)\0)\0)\0)\0)\0)\0)\0)\0x\0o\0p\0q\0)\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0}\0y\0z\0~\0{\0|\0‚\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0y\0z\0l\0{\0|\0ƒ\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0<\0=\0=\0„\0=\0=\0]\0]\0‡\0]\0]\0r\0r\0r\0r\0r\0r\0r\0r\0r\0r\0ˆ\0‰\0Š\0=\0‡\0‹\0€\0€\0]\0€\0€\0>\0>\0Œ\0>\0>\0\0\0\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0€\0’\0“\0”\0•\0>\0–\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0>\0—\0š\0›\0œ\0œ\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0=\0\0\0Ÿ\0 \0¡\0>\0¦\0>\0§\0>\0¨\0@\0@\0>\0@\0@\0«\0>\0¬\0­\0®\0±\0>\0>\0>\0²\0>\0³\0´\0¶\0¹\0º\0»\0>\0@\0u\0u\0u\0u\0u\0u\0u\0u\0u\0u\0¾\0¿\0@\0À\0u\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0 \0Ã\0Ä\0Å\0Æ\0Ç\0È\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0É\0Ê\0Í\0Î\0@\0Ï\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0@\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0Ğ\0Ñ\0Ò\0Õ\0Ö\0×\0Ø\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0Ù\0Ú\0Û\0Ş\0ß\0à\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0á\0â\0ã\0ä\0å\0ë\0ì\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0ï\0õ\0ÿÿÿÿë\0ì\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0C\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0ÿÿí\0î\0ÿÿÿÿÿÿÿÿD\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0í\0î\0ÿÿÿÿÿÿÿÿD\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0D\0E\0E\0ÿÿE\0E\0…\0…\0ÿÿ…\0…\0\0\0ÿÿ\0\0˜\0˜\0ÿÿ˜\0˜\0ÿÿÿÿÿÿE\0µ\0ÿÿ¢\0¢\0…\0¢\0¢\0¤\0¤\0\0¤\0¤\0ÿÿÿÿ˜\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0¢\0ÿÿÿÿÿÿÿÿ¤\0ÿÿE\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0µ\0ÿÿÿÿÿÿÿÿÿÿE\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0E\0F\0F\0ÿÿF\0F\0©\0©\0ÿÿ©\0©\0¯\0¯\0ÿÿ¯\0¯\0·\0·\0ÿÿ·\0·\0ÿÿÿÿÿÿF\0ÿÿÿÿ¼\0¼\0©\0¼\0¼\0Á\0Á\0¯\0Á\0Á\0ÿÿÿÿ·\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0¼\0ÿÿÿÿÿÿÿÿÁ\0ÿÿF\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0ÿÿÿÿÿÿÿÿÿÿÿÿF\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0F\0G\0G\0ÿÿG\0G\0Ë\0Ë\0ÿÿË\0Ë\0Ó\0Ó\0ÿÿÓ\0Ó\0Ü\0Ü\0ÿÿÜ\0Ü\0ÿÿÿÿÿÿG\0ÿÿÿÿñ\0ñ\0Ë\0ñ\0ñ\0ù\0ù\0Ó\0ù\0ù\0ÿÿÿÿÜ\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0ñ\0ÿÿÿÿÿÿÿÿù\0ÿÿG\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0ÿÿÿÿÿÿÿÿÿÿÿÿG\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0G\0J\0J\0ÿÿJ\0J\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿô\0ô\0ÿÿô\0ô\0ÿÿÿÿÿÿJ\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿô\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0ô\0ÿÿô\0ÿÿÿÿÿÿÿÿJ\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0ÿÿÿÿÿÿÿÿÿÿÿÿJ\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0J\0L\0L\0ÿÿL\0L\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿL\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿL\0L\0L\0L\0L\0L\0L\0L\0L\0L\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿL\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0ÿÿÿÿÿÿÿÿÿÿÿÿL\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0L\0M\0M\0ÿÿM\0M\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿM\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿM\0M\0M\0M\0M\0M\0M\0M\0M\0M\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿM\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0ÿÿÿÿÿÿÿÿÿÿÿÿM\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0M\0N\0N\0ÿÿN\0N\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿN\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿN\0N\0N\0N\0N\0N\0N\0N\0N\0N\0N\0O\0O\0O\0O\0O\0O\0O\0O\0O\0O\0O\0O\0O\0O\0O\0O\0O\0O\0O\0O\0O\0O\0O\0O\0O\0O\0P\0P\0ÿÿP\0P\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿP\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿP\0P\0P\0P\0P\0P\0P\0P\0P\0P\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿP\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0ÿÿÿÿÿÿÿÿP\0ÿÿP\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0P\0Q\0Q\0ÿÿQ\0Q\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿQ\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿQ\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿQ\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0ÿÿÿÿÿÿÿÿQ\0ÿÿQ\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0Q\0X\0X\0ÿÿX\0X\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿX\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿX\0X\0X\0X\0X\0X\0X\0X\0X\0X\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿX\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0ÿÿÿÿÿÿÿÿÿÿÿÿX\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0X\0Y\0Y\0ÿÿY\0Y\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿY\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿY\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿY\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0ÿÿÿÿÿÿÿÿÿÿÿÿY\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Y\0Z\0Z\0ÿÿZ\0Z\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿZ\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿZ\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿZ\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0ÿÿÿÿÿÿÿÿÿÿÿÿZ\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0Z\0\\0ÿÿÿÿ\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0ÿÿÿÿÿÿÿÿÿÿÿÿ\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0ÿÿÿÿÿÿÿÿ\\0ÿÿ\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0\\0m\0m\0ÿÿÿÿÿÿÿÿm\0m\0ÿÿÿÿm\0ÿÿÿÿm\0ÿÿÿÿÿÿÿÿÿÿm\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿm\0m\0ÿÿÿÿÿÿÿÿm\0m\0ÿÿÿÿm\0ÿÿÿÿm\0ÿÿÿÿÿÿÿÿÿÿm\0ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ',
   "",
   "",
   "",
   "",
   "",
   ""];
var main=function(lexbuf){return __ocaml_lex_main_rec(lexbuf,0)};
var
 __ocaml_lex_main_rec=
  function(lexbuf,__ocaml_lex_state)
   {var $js$3=Lexing["engine"];
    var
     __ocaml_lex_state$1=
      $js$3(__ocaml_lex_tables,__ocaml_lex_state,lexbuf);
    var $js$4=49<__ocaml_lex_state$1>>>0;
    if($js$4)
     {var $js$5=lexbuf[1];
      $js$5(lexbuf);
      return __ocaml_lex_main_rec(lexbuf,__ocaml_lex_state$1)}
    else
     {var $js$6=__ocaml_lex_state$1;
      var $js$7=$js$6[0];
      if($js$7==0)
       {incr_cpts(lexbuf);
        var $js$8=Lexing["lexeme"];
        var s=$js$8(lexbuf);
        var $js$9=String["sub"];
        var $js$10=$js$9(s,1,1);
        return [3,$js$10]}
      else
       if($js$7==1)
        {incr_cpts(lexbuf);
         var
          $js$11=
           verb_mode[1]||
           target_mode[1]||
           code_pre_mode[1]||
           open_brackets[1]>=
           1;
         if($js$11)
          {var $js$12=Lexing["lexeme"];
           var $js$13=$js$12(lexbuf);
           return [3,$js$13]}
         else
          {var $js$14=ele_ref_mode[1];
           if($js$14){var match=(ele_ref_mode[1]=0,0)}else{var match=0}
           return 0}}
       else
        if($js$7==2)
         {incr_cpts(lexbuf);
          var
           $js$15=
            verb_mode[1]||
            target_mode[1]||
            code_pre_mode[1]||
            open_brackets[1]>=
            1||
            ele_ref_mode[1];
          if($js$15)
           {var $js$16=Lexing["lexeme"];
            var $js$17=$js$16(lexbuf);
            return [3,$js$17]}
          else
           {var $js$18=Lexing["lexeme"];
            var s$1=$js$18(lexbuf);
            try
             {var $js$19=s$1[0]=60;
              if($js$19)
               {var match$1=[0,2,s$1["length"]-3];
                var $js$20=String["sub"];
                var s2=$js$20(s$1,match$1[1],match$1[2]);
                return [0,[0,"unknown primitive:caml_int_of_string",0]]}
              else
               {var match$2=[0,1,s$1["length"]-2];
                var l=match$2[2];
                var $js$21=String["sub"];
                var s2$1=$js$21(s$1,match$2[1],l);
                try
                 {var $js$22=String["index"];
                  var i=$js$22(s2$1,58);
                  var $js$23=String["sub"];
                  var s_n=$js$23(s2$1,0,i);
                  var $js$24=String["sub"];
                  var s_label=$js$24(s2$1,i+1,l-i-1);
                  return [0,
                          [0,"unknown primitive:caml_int_of_string",[0,s_label]]]}
                catch(exn)
                 {var $js$25=exn=Not_found;
                  if($js$25)
                   {return [0,[0,"unknown primitive:caml_int_of_string",0]]}
                  else
                   {return "unknown primitive:reraise"}}}}
            catch(exn$1){return [0,[0,1,0]]}}}
        else
         if($js$7==3)
          {incr_cpts(lexbuf);
           var
            $js$26=
             verb_mode[1]||
             target_mode[1]||
             code_pre_mode[1]||
             open_brackets[1]>=
             1||
             ele_ref_mode[1];
           if($js$26)
            {var $js$27=Lexing["lexeme"];
             var $js$28=$js$27(lexbuf);
             return [3,$js$28]}
           else
            {return 1}}
         else
          if($js$7==4)
           {incr_cpts(lexbuf);
            var
             $js$29=
              verb_mode[1]||
              target_mode[1]||
              code_pre_mode[1]||
              open_brackets[1]>=
              1||
              ele_ref_mode[1];
            if($js$29)
             {var $js$30=Lexing["lexeme"];
              var $js$31=$js$30(lexbuf);
              return [3,$js$31]}
            else
             {return 6}}
          else
           if($js$7==5)
            {incr_cpts(lexbuf);
             var
              $js$32=
               verb_mode[1]||
               target_mode[1]||
               code_pre_mode[1]||
               open_brackets[1]>=
               1||
               ele_ref_mode[1];
             if($js$32)
              {var $js$33=Lexing["lexeme"];
               var $js$34=$js$33(lexbuf);
               return [3,$js$34]}
             else
              {return 10}}
           else
            if($js$7==6)
             {incr_cpts(lexbuf);
              var
               $js$35=
                verb_mode[1]||
                target_mode[1]||
                code_pre_mode[1]||
                open_brackets[1]>=
                1||
                ele_ref_mode[1];
              if($js$35)
               {var $js$36=Lexing["lexeme"];
                var $js$37=$js$36(lexbuf);
                return [3,$js$37]}
              else
               {return 2}}
            else
             if($js$7==7)
              {incr_cpts(lexbuf);
               var
                $js$38=
                 verb_mode[1]||
                 target_mode[1]||
                 code_pre_mode[1]||
                 open_brackets[1]>=
                 1||
                 ele_ref_mode[1];
               if($js$38)
                {var $js$39=Lexing["lexeme"];
                 var $js$40=$js$39(lexbuf);
                 return [3,$js$40]}
               else
                {return 36}}
             else
              if($js$7==8)
               {incr_cpts(lexbuf);
                var
                 $js$41=
                  verb_mode[1]||
                  target_mode[1]||
                  code_pre_mode[1]||
                  open_brackets[1]>=
                  1||
                  ele_ref_mode[1];
                if($js$41)
                 {var $js$42=Lexing["lexeme"];
                  var $js$43=$js$42(lexbuf);
                  return [3,$js$43]}
                else
                 {return 37}}
              else
               if($js$7==9)
                {incr_cpts(lexbuf);
                 var
                  $js$44=
                   verb_mode[1]||
                   target_mode[1]||
                   code_pre_mode[1]||
                   open_brackets[1]>=
                   1||
                   ele_ref_mode[1];
                 if($js$44)
                  {var $js$45=Lexing["lexeme"];
                   var $js$46=$js$45(lexbuf);
                   return [3,$js$46]}
                 else
                  {return 3}}
               else
                if($js$7==10)
                 {incr_cpts(lexbuf);
                  var
                   $js$47=
                    verb_mode[1]||
                    target_mode[1]||
                    code_pre_mode[1]||
                    open_brackets[1]>=
                    1||
                    ele_ref_mode[1];
                  if($js$47)
                   {var $js$48=Lexing["lexeme"];
                    var $js$49=$js$48(lexbuf);
                    return [3,$js$49]}
                  else
                   {return 4}}
                else
                 if($js$7==11)
                  {incr_cpts(lexbuf);
                   var
                    $js$50=
                     verb_mode[1]||
                     target_mode[1]||
                     code_pre_mode[1]||
                     open_brackets[1]>=
                     1||
                     ele_ref_mode[1];
                   if($js$50)
                    {var $js$51=Lexing["lexeme"];
                     var $js$52=$js$51(lexbuf);
                     return [3,$js$52]}
                   else
                    {return 5}}
                 else
                  if($js$7==12)
                   {incr_cpts(lexbuf);
                    var
                     $js$53=
                      verb_mode[1]||
                      target_mode[1]||
                      code_pre_mode[1]||
                      open_brackets[1]>=
                      1||
                      ele_ref_mode[1];
                    if($js$53)
                     {var $js$54=Lexing["lexeme"];
                      var $js$55=$js$54(lexbuf);
                      return [3,$js$55]}
                    else
                     {return 7}}
                  else
                   if($js$7==13)
                    {incr_cpts(lexbuf);
                     var
                      $js$56=
                       verb_mode[1]||
                       target_mode[1]||
                       code_pre_mode[1]||
                       open_brackets[1]>=
                       1||
                       ele_ref_mode[1];
                     if($js$56)
                      {var $js$57=Lexing["lexeme"];
                       var $js$58=$js$57(lexbuf);
                       return [3,$js$58]}
                     else
                      {return 8}}
                   else
                    if($js$7==14)
                     {incr_cpts(lexbuf);
                      var
                       $js$59=
                        verb_mode[1]||
                        target_mode[1]||
                        code_pre_mode[1]||
                        open_brackets[1]>=
                        1||
                        ele_ref_mode[1];
                      if($js$59)
                       {var $js$60=Lexing["lexeme"];
                        var $js$61=$js$60(lexbuf);
                        return [3,$js$61]}
                      else
                       {return 9}}
                    else
                     if($js$7==15)
                      {incr_cpts(lexbuf);
                       var
                        $js$62=
                         verb_mode[1]||
                         target_mode[1]||
                         code_pre_mode[1]||
                         open_brackets[1]>=
                         1||
                         ele_ref_mode[1];
                       if($js$62)
                        {var $js$63=Lexing["lexeme"];
                         var $js$64=$js$63(lexbuf);
                         return [3,$js$64]}
                       else
                        {var $js$65=Lexing["lexeme"];
                         var s$2=$js$65(lexbuf);
                         var $js$66=String["index"];
                         var p1=$js$66(s$2,37);
                         var $js$67=String["index"];
                         var p2=$js$67(s$2,58);
                         var $js$68=String["sub"];
                         var fmt=$js$68(s$2,p1+1,p2-p1-1);
                         target_mode[1]=1,0;
                         return [2,fmt]}}
                     else
                      if($js$7==16)
                       {incr_cpts(lexbuf);
                        var
                         $js$69=
                          verb_mode[1]||
                          target_mode[1]||
                          code_pre_mode[1]||
                          open_brackets[1]>=
                          1||
                          ele_ref_mode[1];
                        if($js$69)
                         {var $js$70=Lexing["lexeme"];
                          var $js$71=$js$70(lexbuf);
                          return [3,$js$71]}
                        else
                         {target_mode[1]=1,0;return 17}}
                      else
                       if($js$7==17)
                        {incr_cpts(lexbuf);
                         var
                          $js$72=
                           verb_mode[1]||
                           open_brackets[1]>=
                           1||
                           code_pre_mode[1]||
                           ele_ref_mode[1];
                         if($js$72)
                          {var $js$73=Lexing["lexeme"];
                           var $js$74=$js$73(lexbuf);
                           return [3,$js$74]}
                         else
                          {target_mode[1]=0,0;return 18}}
                       else
                        if($js$7==18)
                         {var exit=21}
                        else
                         if($js$7==19)
                          {incr_cpts(lexbuf);
                           var
                            $js$75=
                             verb_mode[1]||
                             target_mode[1]||
                             code_pre_mode[1]||
                             ele_ref_mode[1];
                           if($js$75)
                            {var $js$76=Lexing["lexeme"];
                             var $js$77=$js$76(lexbuf);
                             return [3,$js$77]}
                           else
                            {var $js$78=open_brackets[1]<=0;
                             if($js$78)
                              {open_brackets[1]=1,0;return 11}
                             else
                              {open_brackets[0]++;
                               var $js$79=Lexing["lexeme"];
                               var $js$80=$js$79(lexbuf);
                               return [3,$js$80]}}}
                         else
                          if($js$7==20)
                           {incr_cpts(lexbuf);
                            var
                             $js$81=
                              verb_mode[1]||
                              target_mode[1]||
                              code_pre_mode[1]||
                              ele_ref_mode[1];
                            if($js$81)
                             {var $js$82=Lexing["lexeme"];
                              var $js$83=$js$82(lexbuf);
                              return [3,$js$83]}
                            else
                             {var $js$84=open_brackets[1]>1;
                              if($js$84)
                               {open_brackets[0]--;return [3,"]"]}
                              else
                               {open_brackets[1]=0,0;return 12}}}
                          else
                           if($js$7==21)
                            {var exit=21}
                           else
                            if($js$7==22)
                             {incr_cpts(lexbuf);
                              var
                               $js$85=
                                verb_mode[1]||
                                target_mode[1]||
                                code_pre_mode[1]||
                                ele_ref_mode[1];
                              if($js$85)
                               {var $js$86=Lexing["lexeme"];
                                var $js$87=$js$86(lexbuf);
                                return [3,$js$87]}
                              else
                               {code_pre_mode[1]=1,0;return 13}}
                            else
                             if($js$7==23)
                              {incr_cpts(lexbuf);
                               var $js$88=verb_mode[1]||target_mode[1]||ele_ref_mode[1];
                               if($js$88)
                                {var $js$89=Lexing["lexeme"];
                                 var $js$90=$js$89(lexbuf);
                                 return [3,$js$90]}
                               else
                                {var $js$91=open_brackets[1]>=1;
                                 if($js$91)
                                  {lexbuf[6]=lexbuf[6]-1,0;
                                   var init$1=lexbuf[12];
                                   var
                                    $js$92=
                                     [0,init$1[1],init$1[2],init$1[3],lexbuf[12][4]-1];
                                   lexbuf[12]=$js$92,0;
                                   char_number[0]--;
                                   var $js$93=open_brackets[1]>1;
                                   if($js$93)
                                    {open_brackets[0]--;return [3,"]"]}
                                   else
                                    {open_brackets[1]=0,0;return 12}}
                                 else
                                  {var $js$94=code_pre_mode[1];
                                   if($js$94)
                                    {code_pre_mode[1]=0,0;return 14}
                                   else
                                    {var $js$95=Lexing["lexeme"];
                                     var $js$96=$js$95(lexbuf);
                                     return [3,$js$96]}}}}
                             else
                              if($js$7==24)
                               {var exit=21}
                              else
                               if($js$7==25)
                                {incr_cpts(lexbuf);
                                 var
                                  $js$97=
                                   verb_mode[1]||
                                   target_mode[1]||
                                   code_pre_mode[1]||
                                   open_brackets[1]>=
                                   1;
                                 if($js$97)
                                  {var $js$98=Lexing["lexeme"];
                                   var $js$99=$js$98(lexbuf);
                                   return [3,$js$99]}
                                 else
                                  {var $js$100=!ele_ref_mode[1];
                                   if($js$100)
                                    {ele_ref_mode[1]=1,0;return 20}
                                   else
                                    {var $js$101=Lexing["lexeme"];
                                     var $js$102=$js$101(lexbuf);
                                     return [3,$js$102]}}}
                               else
                                if($js$7==26)
                                 {incr_cpts(lexbuf);
                                  var
                                   $js$103=
                                    verb_mode[1]||
                                    target_mode[1]||
                                    code_pre_mode[1]||
                                    open_brackets[1]>=
                                    1;
                                  if($js$103)
                                   {var $js$104=Lexing["lexeme"];
                                    var $js$105=$js$104(lexbuf);
                                    return [3,$js$105]}
                                  else
                                   {var $js$106=!ele_ref_mode[1];
                                    if($js$106)
                                     {ele_ref_mode[1]=1,0;return 21}
                                    else
                                     {var $js$107=Lexing["lexeme"];
                                      var $js$108=$js$107(lexbuf);
                                      return [3,$js$108]}}}
                                else
                                 if($js$7==27)
                                  {incr_cpts(lexbuf);
                                   var
                                    $js$109=
                                     verb_mode[1]||
                                     target_mode[1]||
                                     code_pre_mode[1]||
                                     open_brackets[1]>=
                                     1;
                                   if($js$109)
                                    {var $js$110=Lexing["lexeme"];
                                     var $js$111=$js$110(lexbuf);
                                     return [3,$js$111]}
                                   else
                                    {var $js$112=!ele_ref_mode[1];
                                     if($js$112)
                                      {ele_ref_mode[1]=1,0;return 22}
                                     else
                                      {var $js$113=Lexing["lexeme"];
                                       var $js$114=$js$113(lexbuf);
                                       return [3,$js$114]}}}
                                 else
                                  if($js$7==28)
                                   {incr_cpts(lexbuf);
                                    var
                                     $js$115=
                                      verb_mode[1]||
                                      target_mode[1]||
                                      code_pre_mode[1]||
                                      open_brackets[1]>=
                                      1;
                                    if($js$115)
                                     {var $js$116=Lexing["lexeme"];
                                      var $js$117=$js$116(lexbuf);
                                      return [3,$js$117]}
                                    else
                                     {var $js$118=!ele_ref_mode[1];
                                      if($js$118)
                                       {ele_ref_mode[1]=1,0;return 23}
                                      else
                                       {var $js$119=Lexing["lexeme"];
                                        var $js$120=$js$119(lexbuf);
                                        return [3,$js$120]}}}
                                  else
                                   if($js$7==29)
                                    {incr_cpts(lexbuf);
                                     var
                                      $js$121=
                                       verb_mode[1]||
                                       target_mode[1]||
                                       code_pre_mode[1]||
                                       open_brackets[1]>=
                                       1;
                                     if($js$121)
                                      {var $js$122=Lexing["lexeme"];
                                       var $js$123=$js$122(lexbuf);
                                       return [3,$js$123]}
                                     else
                                      {var $js$124=!ele_ref_mode[1];
                                       if($js$124)
                                        {ele_ref_mode[1]=1,0;return 24}
                                       else
                                        {var $js$125=Lexing["lexeme"];
                                         var $js$126=$js$125(lexbuf);
                                         return [3,$js$126]}}}
                                   else
                                    if($js$7==30)
                                     {incr_cpts(lexbuf);
                                      var
                                       $js$127=
                                        verb_mode[1]||
                                        target_mode[1]||
                                        code_pre_mode[1]||
                                        open_brackets[1]>=
                                        1;
                                      if($js$127)
                                       {var $js$128=Lexing["lexeme"];
                                        var $js$129=$js$128(lexbuf);
                                        return [3,$js$129]}
                                      else
                                       {var $js$130=!ele_ref_mode[1];
                                        if($js$130)
                                         {ele_ref_mode[1]=1,0;return 25}
                                        else
                                         {var $js$131=Lexing["lexeme"];
                                          var $js$132=$js$131(lexbuf);
                                          return [3,$js$132]}}}
                                    else
                                     if($js$7==31)
                                      {incr_cpts(lexbuf);
                                       var
                                        $js$133=
                                         verb_mode[1]||
                                         target_mode[1]||
                                         code_pre_mode[1]||
                                         open_brackets[1]>=
                                         1;
                                       if($js$133)
                                        {var $js$134=Lexing["lexeme"];
                                         var $js$135=$js$134(lexbuf);
                                         return [3,$js$135]}
                                       else
                                        {var $js$136=!ele_ref_mode[1];
                                         if($js$136)
                                          {ele_ref_mode[1]=1,0;return 26}
                                         else
                                          {var $js$137=Lexing["lexeme"];
                                           var $js$138=$js$137(lexbuf);
                                           return [3,$js$138]}}}
                                     else
                                      if($js$7==32)
                                       {incr_cpts(lexbuf);
                                        var
                                         $js$139=
                                          verb_mode[1]||
                                          target_mode[1]||
                                          code_pre_mode[1]||
                                          open_brackets[1]>=
                                          1;
                                        if($js$139)
                                         {var $js$140=Lexing["lexeme"];
                                          var $js$141=$js$140(lexbuf);
                                          return [3,$js$141]}
                                        else
                                         {var $js$142=!ele_ref_mode[1];
                                          if($js$142)
                                           {ele_ref_mode[1]=1,0;return 27}
                                          else
                                           {var $js$143=Lexing["lexeme"];
                                            var $js$144=$js$143(lexbuf);
                                            return [3,$js$144]}}}
                                      else
                                       if($js$7==33)
                                        {incr_cpts(lexbuf);
                                         var
                                          $js$145=
                                           verb_mode[1]||
                                           target_mode[1]||
                                           code_pre_mode[1]||
                                           open_brackets[1]>=
                                           1;
                                         if($js$145)
                                          {var $js$146=Lexing["lexeme"];
                                           var $js$147=$js$146(lexbuf);
                                           return [3,$js$147]}
                                         else
                                          {var $js$148=!ele_ref_mode[1];
                                           if($js$148)
                                            {ele_ref_mode[1]=1,0;return 28}
                                           else
                                            {var $js$149=Lexing["lexeme"];
                                             var $js$150=$js$149(lexbuf);
                                             return [3,$js$150]}}}
                                       else
                                        if($js$7==34)
                                         {incr_cpts(lexbuf);
                                          var
                                           $js$151=
                                            verb_mode[1]||
                                            target_mode[1]||
                                            code_pre_mode[1]||
                                            open_brackets[1]>=
                                            1;
                                          if($js$151)
                                           {var $js$152=Lexing["lexeme"];
                                            var $js$153=$js$152(lexbuf);
                                            return [3,$js$153]}
                                          else
                                           {var $js$154=!ele_ref_mode[1];
                                            if($js$154)
                                             {ele_ref_mode[1]=1,0;return 29}
                                            else
                                             {var $js$155=Lexing["lexeme"];
                                              var $js$156=$js$155(lexbuf);
                                              return [3,$js$156]}}}
                                        else
                                         if($js$7==35)
                                          {incr_cpts(lexbuf);
                                           var
                                            $js$157=
                                             verb_mode[1]||
                                             target_mode[1]||
                                             code_pre_mode[1]||
                                             open_brackets[1]>=
                                             1;
                                           if($js$157)
                                            {var $js$158=Lexing["lexeme"];
                                             var $js$159=$js$158(lexbuf);
                                             return [3,$js$159]}
                                           else
                                            {var $js$160=!ele_ref_mode[1];
                                             if($js$160)
                                              {ele_ref_mode[1]=1,0;return 30}
                                             else
                                              {var $js$161=Lexing["lexeme"];
                                               var $js$162=$js$161(lexbuf);
                                               return [3,$js$162]}}}
                                         else
                                          if($js$7==36)
                                           {incr_cpts(lexbuf);
                                            var
                                             $js$163=
                                              verb_mode[1]||
                                              target_mode[1]||
                                              code_pre_mode[1]||
                                              open_brackets[1]>=
                                              1;
                                            if($js$163)
                                             {var $js$164=Lexing["lexeme"];
                                              var $js$165=$js$164(lexbuf);
                                              return [3,$js$165]}
                                            else
                                             {var $js$166=!ele_ref_mode[1];
                                              if($js$166)
                                               {ele_ref_mode[1]=1,0;return 31}
                                              else
                                               {var $js$167=Lexing["lexeme"];
                                                var $js$168=$js$167(lexbuf);
                                                return [3,$js$168]}}}
                                          else
                                           if($js$7==37)
                                            {incr_cpts(lexbuf);
                                             var
                                              $js$169=
                                               verb_mode[1]||
                                               target_mode[1]||
                                               code_pre_mode[1]||
                                               open_brackets[1]>=
                                               1;
                                             if($js$169)
                                              {var $js$170=Lexing["lexeme"];
                                               var $js$171=$js$170(lexbuf);
                                               return [3,$js$171]}
                                             else
                                              {var $js$172=!ele_ref_mode[1];
                                               if($js$172)
                                                {ele_ref_mode[1]=1,0;return 32}
                                               else
                                                {var $js$173=Lexing["lexeme"];
                                                 var $js$174=$js$173(lexbuf);
                                                 return [3,$js$174]}}}
                                           else
                                            if($js$7==38)
                                             {incr_cpts(lexbuf);
                                              var
                                               $js$175=
                                                verb_mode[1]||
                                                target_mode[1]||
                                                code_pre_mode[1]||
                                                open_brackets[1]>=
                                                1;
                                              if($js$175)
                                               {var $js$176=Lexing["lexeme"];
                                                var $js$177=$js$176(lexbuf);
                                                return [3,$js$177]}
                                              else
                                               {var $js$178=!ele_ref_mode[1];
                                                if($js$178)
                                                 {ele_ref_mode[1]=1,0;return 33}
                                                else
                                                 {var $js$179=Lexing["lexeme"];
                                                  var $js$180=$js$179(lexbuf);
                                                  return [3,$js$180]}}}
                                            else
                                             if($js$7==39)
                                              {incr_cpts(lexbuf);
                                               var
                                                $js$181=
                                                 verb_mode[1]||
                                                 target_mode[1]||
                                                 code_pre_mode[1]||
                                                 open_brackets[1]>=
                                                 1;
                                               if($js$181)
                                                {var $js$182=Lexing["lexeme"];
                                                 var $js$183=$js$182(lexbuf);
                                                 return [3,$js$183]}
                                               else
                                                {var $js$184=!ele_ref_mode[1];
                                                 if($js$184)
                                                  {ele_ref_mode[1]=1,0;return 34}
                                                 else
                                                  {var $js$185=Lexing["lexeme"];
                                                   var $js$186=$js$185(lexbuf);
                                                   return [3,$js$186]}}}
                                             else
                                              if($js$7==40)
                                               {incr_cpts(lexbuf);
                                                var
                                                 $js$187=
                                                  verb_mode[1]||
                                                  target_mode[1]||
                                                  code_pre_mode[1]||
                                                  open_brackets[1]>=
                                                  1;
                                                if($js$187)
                                                 {var $js$188=Lexing["lexeme"];
                                                  var $js$189=$js$188(lexbuf);
                                                  return [3,$js$189]}
                                                else
                                                 {var $js$190=!ele_ref_mode[1];
                                                  if($js$190)
                                                   {return 35}
                                                  else
                                                   {var $js$191=Lexing["lexeme"];
                                                    var $js$192=$js$191(lexbuf);
                                                    return [3,$js$192]}}}
                                              else
                                               if($js$7==41)
                                                {incr_cpts(lexbuf);
                                                 var
                                                  $js$193=
                                                   target_mode[1]||
                                                   open_brackets[1]>=
                                                   1||
                                                   code_pre_mode[1]||
                                                   ele_ref_mode[1];
                                                 if($js$193)
                                                  {var $js$194=Lexing["lexeme"];
                                                   var $js$195=$js$194(lexbuf);
                                                   return [3,$js$195]}
                                                 else
                                                  {verb_mode[1]=1,0;return 15}}
                                               else
                                                if($js$7==42)
                                                 {incr_cpts(lexbuf);
                                                  var
                                                   $js$196=
                                                    target_mode[1]||
                                                    open_brackets[1]>=
                                                    1||
                                                    code_pre_mode[1]||
                                                    ele_ref_mode[1];
                                                  if($js$196)
                                                   {var $js$197=Lexing["lexeme"];
                                                    var $js$198=$js$197(lexbuf);
                                                    return [3,$js$198]}
                                                  else
                                                   {verb_mode[1]=0,0;return 16}}
                                                else
                                                 if($js$7==43)
                                                  {incr_cpts(lexbuf);
                                                   var
                                                    $js$199=
                                                     target_mode[1]||
                                                     open_brackets[1]>=
                                                     1||
                                                     code_pre_mode[1]||
                                                     ele_ref_mode[1]||
                                                     verb_mode[1];
                                                   if($js$199)
                                                    {var $js$200=Lexing["lexeme"];
                                                     var $js$201=$js$200(lexbuf);
                                                     return [3,$js$201]}
                                                   else
                                                    {var $js$202=shortcut_list_mode[1];
                                                     if($js$202)
                                                      {return 40}
                                                     else
                                                      {shortcut_list_mode[1]=1,0;return 38}}}
                                                 else
                                                  if($js$7==44)
                                                   {incr_cpts(lexbuf);
                                                    var
                                                     $js$203=
                                                      target_mode[1]||
                                                      open_brackets[1]>=
                                                      1||
                                                      code_pre_mode[1]||
                                                      ele_ref_mode[1]||
                                                      verb_mode[1];
                                                    if($js$203)
                                                     {var $js$204=Lexing["lexeme"];
                                                      var $js$205=$js$204(lexbuf);
                                                      return [3,$js$205]}
                                                    else
                                                     {var $js$206=shortcut_list_mode[1];
                                                      if($js$206)
                                                       {return 41}
                                                      else
                                                       {shortcut_list_mode[1]=1,0;return 39}}}
                                                  else
                                                   if($js$7==45)
                                                    {incr_cpts(lexbuf);
                                                     lexbuf[6]=lexbuf[6]-1,0;
                                                     var init$2=lexbuf[12];
                                                     var
                                                      $js$207=
                                                       [0,init$2[1],init$2[2],init$2[3],lexbuf[12][4]-1];
                                                     lexbuf[12]=$js$207,0;
                                                     line_number[0]--;
                                                     var $js$208=shortcut_list_mode[1];
                                                     if($js$208)
                                                      {shortcut_list_mode[1]=0,0;return 42}
                                                     else
                                                      {var
                                                        $js$209=
                                                         target_mode[1]||
                                                         open_brackets[1]>=
                                                         1||
                                                         code_pre_mode[1]||
                                                         ele_ref_mode[1]||
                                                         verb_mode[1];
                                                       if($js$209)
                                                        {var $js$210=Lexing["lexeme"];
                                                         var $js$211=$js$210(lexbuf);
                                                         return [3,$js$211]}
                                                       else
                                                        {return 43}}}
                                                   else
                                                    if($js$7==46)
                                                     {return 44}
                                                    else
                                                     if($js$7==47)
                                                      {incr_cpts(lexbuf);
                                                       var
                                                        $js$212=
                                                         verb_mode[1]||
                                                         target_mode[1]||
                                                         code_pre_mode[1]||
                                                         open_brackets[1]>=
                                                         1||
                                                         ele_ref_mode[1];
                                                       if($js$212)
                                                        {var $js$213=Lexing["lexeme"];
                                                         var $js$214=$js$213(lexbuf);
                                                         return [3,$js$214]}
                                                       else
                                                        {var $js$215=Lexing["lexeme"];
                                                         var s$3=$js$215(lexbuf);
                                                         var len=s$3["length"];
                                                         var $js$216=Odoc_misc["no_blanks"];
                                                         var $js$217=String["sub"];
                                                         var $js$218=$js$217(s$3,1,len-1);
                                                         var tag=$js$216($js$218);
                                                         return [1,tag]}}
                                                     else
                                                      if($js$7==48)
                                                       {incr_cpts(lexbuf);
                                                        var
                                                         $js$219=
                                                          target_mode[1]||
                                                          open_brackets[1]>=
                                                          1||
                                                          code_pre_mode[1]||
                                                          ele_ref_mode[1];
                                                        if($js$219)
                                                         {var $js$220=Lexing["lexeme"];
                                                          var $js$221=$js$220(lexbuf);
                                                          return [3,$js$221]}
                                                        else
                                                         {return 19}}
                                                      else
                                                       if($js$7==49){var exit=21}}
    switch(exit)
     {case 21:
       incr_cpts(lexbuf);
       var $js$222=Lexing["lexeme"];
       var $js$223=$js$222(lexbuf);
       return [3,$js$223]
      }};
module["exports"]=
{"line_number":line_number,
 "char_number":char_number,
 "string_buffer":string_buffer,
 "reset_string_buffer":reset_string_buffer,
 "ajout_char_string":ajout_char_string,
 "ajout_string":ajout_string,
 "lecture_string":lecture_string,
 "description":description,
 "blank":blank,
 "open_brackets":open_brackets,
 "verb_mode":verb_mode,
 "target_mode":target_mode,
 "shortcut_list_mode":shortcut_list_mode,
 "ele_ref_mode":ele_ref_mode,
 "code_pre_mode":code_pre_mode,
 "init":init,
 "incr_cpts":incr_cpts,
 "__ocaml_lex_tables":__ocaml_lex_tables,
 "main":main,
 "__ocaml_lex_main_rec":__ocaml_lex_main_rec};
